{"class_name": "Functional", "config": {"name": "bilstm2p", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "seq_input"}, "name": "seq_input", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.not_equal_2", "trainable": true, "dtype": "float32", "function": "math.not_equal"}, "name": "tf.math.not_equal_2", "inbound_nodes": [["seq_input", 0, 0, {"y": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_any_2", "trainable": true, "dtype": "float32", "function": "math.reduce_any"}, "name": "tf.math.reduce_any_2", "inbound_nodes": [["tf.math.not_equal_2", 0, 0, {"axis": -1}]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 16, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 4.999999873689376e-06, "l2": 0.0}, "shared_object_id": 6}, "recurrent_regularizer": {"class_name": "L1L2", "config": {"l1": 4.999999873689376e-06, "l2": 0.0}, "shared_object_id": 7}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_2", "inbound_nodes": [[["seq_input", 0, 0, {"mask": ["tf.math.reduce_any_2", 0, 0]}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 16, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 11}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 12}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 13}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 4.999999873689376e-06, "l2": 0.0}, "shared_object_id": 14}, "recurrent_regularizer": {"class_name": "L1L2", "config": {"l1": 4.999999873689376e-06, "l2": 0.0}, "shared_object_id": 15}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_3", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "head", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "head", "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]]}], "input_layers": [["seq_input", 0, 0]], "output_layers": [["head", 0, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}